Catalogs/ВидыПалат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыПалат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыПалат/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.Прейскурант = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	мсСтрокиКУдалению = Новый Массив;
	Для Каждого стрУслуг из Объект.ОсновныеУслуги Цикл 
		Если стрУслуг.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда 
			мсСтрокиКУдалению.Добавить(стрУслуг);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого элМассива из мсСтрокиКУдалению Цикл 
		Объект.ОсновныеУслуги.Удалить(элМассива); 
	КонецЦикла;

КонецПроцедуры
